Repository: platine-php/validator
Catalog: lang/*/LC_MESSAGES/validators.po
Languages: fr_fr

source: %s must contain alphabetic characters
fr_fr: %s doit contenir des caractères alphabétiques

source: %s must contain alphabetic characters, - and _
fr_fr: %s doit contenir des caractères alphabétiques, - et _

source: %s must contain alphanumeric characters!
fr_fr: %s doit contenir des caractères alphanumériques !

source: %s must contain alphanumeric characters, - and _
fr_fr: %s doit contenir des caractères alphanumériques, - et _

source: %s must contain a correct date format [%s]!
fr_fr: %s doit contenir un format de date correct [%s] !

source: %s must be after or equal to the date [%s]!
fr_fr: %s doit être égale ou après la date [%s] !

source: %s must be after the date [%s]!
fr_fr: %s doit être après la date [%s] !

source: %s must be before or equal to the date [%s]!
fr_fr: %s doit être antérieur ou égale à la date [%s] !

source: %s must be before the date [%s]!
fr_fr: %s doit être antérieur à la date [%s] !

source: %s must be a valid email address!
fr_fr: %s doit être une adresse e-mail valide !

source: %s must be one of the following (%s)!
fr_fr: %s doit être l'un des suivants (%s) !

source: %s must to be equal to [%s]!
fr_fr: %s doit être égal à [%s] !

source: %s must contain exactly %d characters!
fr_fr: %s doit contenir exactement %d caractères !

source: %s must be a valid ip address!
fr_fr: %s doit être une adresse IP valide !

source: %s must be a valid IPv4 address!
fr_fr: %s doit être une adresse IPv4 valide !

source: %s must be a valid IPv6 address!
fr_fr: %s doit être une adresse IPv6 valide !

source: %s must be an integer!
fr_fr: %s doit être un entier !

source: %s must be identical to field %s!
fr_fr: %s doit être identique au champ %s !

source: %s must be less or equal to [%s]!
fr_fr: %s doit être inférieur ou égal à [%s] !

source: %s must contain at most %d characters!
fr_fr: %s doit contenir au plus %d caractères !

source: %s must be greather or equal to [%s]!
fr_fr: %s doit être supérieur ou égal à [%s] !

source: %s must contain at least %d characters!
fr_fr: %s doit contenir au moins %d caractères !

source: %s must be a natural number (0, 1, 2, )!
fr_fr: %s doit être un nombre naturel (0, 1, 2, ) !

source: %s must not to be empty!
fr_fr: %s ne doit pas être vide !

source: %s must not to be equal to [%s]!
fr_fr: %s ne doit pas être égal à [%s] !

source: %s must not to be identical to field %s!
fr_fr: %s ne doit pas être identique au champ %s !

source: %s must be a number!
fr_fr: %s doit être un nombre !

source: %s should include at least one lower case!
fr_fr: %s doit comporter au moins un caractère minuscule !

source: %s should include at least one upper case!
fr_fr: %s doit comporter au moins un caractère majuscule !

source: %s should include at least one number!
fr_fr: %s doit comporter au moins un chiffre !

source: %s should include at least one special character!
fr_fr: %s doit comporter au moins un caractère spécial !

source: %s must be between %s and %s!
fr_fr: %s doit être compris entre %s et %s !

source: %s does not use the correct format!
fr_fr: %s n'utilise pas le bon format !

source: %s must be a valid URL!
fr_fr: %s doit être une URL valide !

source: %s must be a valid UUID!
fr_fr: %s doit être un UUID valide !
